Triixk/EE4450-Projects/RTOS_UART_Project_Psoc1_V2.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "UART.h"
#include "LED_aliases.h"
#include "LED.h"
#include "ISR_UART.h"
#include "timer_clock.h"
#include "Timer.h"
#include "Echo_aliases.h"
#include "Echo.h"
#include "Trigger_aliases.h"
#include "Trigger.h"
#include "PWM_Servo.h"
#include "Clock_2.h"
#include "SERVO_aliases.h"
#include "SERVO.h"
#include "PWM_Music.h"
#include "BUZZER_aliases.h"
#include "BUZZER.h"
#include "Clock_1.h"
#include "UART_USB.h"
#include "UART_IntClock.h"
#include "UART_USB_IntClock.h"
#include "cy_em_eeprom.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"

/*[]*/

